{
  "Aries": {
    "Atlantis": "As a sporty and adventurous Aries, Atlantis is your perfect match. Its fresh and energetic profile complements your dynamic personality. The zesty grapefruit and black currant top notes reflect your enthusiasm, while the sea salt and pine heart notes channel your pioneering spirit. This scent will keep up with your energetic lifestyle while adding a sophisticated touch to your natural confidence.",
    "Feeling Good": "Sweet with a kick—just like you, Aries! Feeling Good's raspberry and peony notes complement your spontaneous nature, while the warm base of amber and praline reflects your passionate side. This scent adds a playful dimension to your bold personality.",
    "Shelby": "Shelby's charismatic blend resonates with your magnetic Aries energy. Its unique combination of sage, grapefruit, and quince mirrors your distinctive personality, while the woody base notes ground your fiery nature. This scent enhances your natural leadership qualities.",
    "Revolt": "Bold and fearless like a true Aries, Revolt matches your trailblazing spirit. The spicy ginger and pepper top notes complement your adventurous nature, while the leather and incense base reflects your courage. This scent emphasizes your natural ability to lead and inspire."
  },
  "Taurus": {
    "Atlantis": "For the consistently sporty Taurus, Atlantis offers steady refreshment. Its balanced composition of citrus and aquatic notes complements your reliable nature, while the amber base provides the comfort you seek. This scent supports your enduring energy and appreciation for life's pleasures.",
    "1970": "The warm, nostalgic profile of 1970 perfectly complements your grounded Taurus nature. With vanilla, cinnamon, and honey blending into tobacco and leather, this scent reflects your appreciation for life's enduring pleasures and your patient, determined character.",
    "Royal": "Royal's distinguished character matches your Taurus appreciation for luxury and quality. The refined blend of bergamot, rose, and precious oud speaks to your taste for enduring elegance. This scent enhances your natural sophistication and steadfast presence.",
    "Garden Breeze": "Garden Breeze's fresh, gentle profile resonates with your earth-loving Taurus soul. The green notes and florals mirror your connection to nature, while the cedar and musk base provides the stability you value. This scent enhances your calm reliability and sensual appreciation for natural beauty."
  },
  "Gemini": {
    "Atlantis": "For the actively non-stop Gemini, Atlantis offers versatile freshness. Its complex profile of citrus, aquatic, and woody notes keeps up with your multifaceted personality and provides interesting contrasts that satisfy your curious mind. This scent complements your dynamic energy and sociable nature.",
    "Feeling Good": "Sweet & dynamic—perfect for your Gemini versatility! Feeling Good's playful blend of raspberry, floral notes, and warm amber mirrors your adaptable, sociable nature. This scent keeps up with your ever-changing moods while maintaining a consistently delightful presence.",
    "Shelby": "Shelby's intriguing complexity is ideal for your multifaceted Gemini personality. The unexpected blend of sage, fruits, and woods offers the variety you crave, while maintaining a coherent character. This scent enhances your natural charm and communicative gifts.",
    "Utopia": "Utopia's dreamy, floral character complements your imaginative Gemini mind. The lavender and violet blend offers variety while the vanilla base provides a constant through-line—perfect for your dual nature. This scent enhances your intellectual curiosity and expressive abilities."
  },
  "Cancer": {
    "Atlantis": "For the comfortably sporty Cancer, Atlantis provides refreshing energy with a comforting base. Its aquatic notes connect to your water sign nature, while the amber and praline base offers the emotional security you value. This scent balances activity with the nurturing quality you naturally possess.",
    "Feeling Good": "Soft, dreamy, and lovely—Feeling Good mirrors your nurturing Cancer nature. Its sweet raspberry and peony blend, coupled with warm ambery notes, reflects your emotional depth and caring personality. This scent enhances your natural ability to create comfort and connection.",
    "1970": "The nostalgic warmth of 1970 resonates with your sentimental Cancer heart. Its honey, vanilla, and woody notes create the emotional depth and comfort you crave, while the sophisticated profile matches your intuitive understanding of feelings. This scent enhances your nurturing presence.",
    "Utopia": "Utopia's soothing, dreamy character perfectly complements your empathetic Cancer nature. The lavender and chamomile notes provide emotional comfort, while the vanilla base creates the secure feeling you value. This scent enhances your intuitive and nurturing qualities."
  },
  "Leo": {
    "Atlantis": "For the stunningly athletic Leo, Atlantis provides fresh energy with a memorable presence. Its bright profile ensures you stand out in any setting, while the complex layers reveal themselves over time—just like your multifaceted personality. This scent enhances your natural confidence and star quality.",
    "Feeling Good": "Sweet & glamorous, Feeling Good complements your charismatic Leo nature! Its joyful blend of raspberry, florals, and praline reflects your warm-hearted personality and love of attention. This scent enhances your natural ability to light up a room.",
    "Shelby": "Shelby's magnetic presence perfectly matches your charismatic Leo energy. Its sophisticated blend creates a memorable impression—exactly what you desire. The smooth sandalwood base reflects your warm heart, while the brighter notes mirror your sunny disposition. This scent enhances your natural star quality.",
    "Royal": "Royal's distinguished elegance is made for your regal Leo nature. The luxurious combination of bergamot, rose, and precious oud creates the impressive aura you naturally command. This scent enhances your confident leadership and generous spirit."
  },
  "Virgo": {
    "Atlantis": "For the well-organized Virgo, Atlantis offers precise freshness. Its clean, structured composition satisfies your attention to detail, while the natural elements connect to your earth sign roots. This balanced scent supports your practical approach to activity and methodical nature.",
    "Shelby": "Shelby's refined complexity satisfies your discriminating Virgo taste. The precise balance of sage, fruits, and woods reflects your analytical mind and appreciation for quality craftsmanship. This scent enhances your natural elegance and attention to detail.",
    "Utopia": "Utopia's pure, calming profile perfectly complements your methodical Virgo nature. The lavender and violet notes provide clarity and precision, while the harmonious composition satisfies your attention to detail. This scent enhances your analytical abilities and healing presence.",
    "Garden Breeze": "Garden Breeze's clean, natural character resonates with your practical Virgo sensibilities. The fresh mint and green notes reflect your clear thinking, while the balanced composition satisfies your desire for order. This scent enhances your efficient energy and helpful nature."
  },
  "Libra": {
    "Atlantis": "For the chic and sporty Libra, Atlantis offers balanced freshness. Its harmonious blend of citrus, aquatic, and amber notes satisfies your desire for equilibrium. The refined composition complements your aesthetic sensibilities and sociable nature.",
    "Feeling Good": "Romantic & chic, Feeling Good embodies your balanced Libra essence. Its harmonious blend of raspberry, peonies, and warm amber reflects your desire for beauty and social connection. This scent enhances your natural diplomacy and charm.",
    "Utopia": "Utopia's harmonious, balanced character perfectly complements your equilibrium-seeking Libra nature. The delicate floral notes satisfy your aesthetic sensibilities, while the soothing profile supports your desire for peace. This scent enhances your diplomatic talents and appreciation for beauty.",
    "Garden Breeze": "Garden Breeze's elegant freshness resonates with your balanced Libra spirit. The harmonious blend of green notes and florals reflects your aesthetic sensibilities, while the clean profile supports your desire for harmony. This scent enhances your diplomatic nature and social grace."
  },
  "Scorpio": {
    "Atlantis": "For the full-of-energy Scorpio, Atlantis offers invigorating freshness with hidden depth. Its surface brightness gives way to complex base notes—much like your mysterious personality. This multifaceted scent supports your intense nature and powerful presence.",
    "Shelby": "Shelby's mysteriously sweet profile perfectly matches your enigmatic Scorpio energy. Its complex layers unfold gradually—just like getting to know you. The sage and woody base notes reflect your depth, while the fruity elements reveal your passionate nature. This scent enhances your magnetic presence.",
    "1970": "The deep, complex character of 1970 resonates with your intense Scorpio nature. Its powerful blend of spices, tobacco, and leather reflects your passionate disposition and emotional depth. This scent enhances your magnetic presence and transformative power.",
    "Revolt": "Revolt's bold intensity is made for your powerful Scorpio spirit. The spicy, woody, and incense notes mirror your passionate nature and fearless approach to life. This scent enhances your natural magnetism and emotional depth."
  },
  "Sagittarius": {
    "Atlantis": "For the unstoppable Sagittarius, Atlantis offers exhilarating freshness that keeps up with your love of adventure. Its bright, expansive character matches your optimistic outlook, while the natural elements connect to your love of the outdoors. This dynamic scent supports your exploratory spirit.",
    "Feeling Good": "Fun & sweet, Feeling Good complements your optimistic Sagittarius spirit! Its playful, joyful blend matches your enthusiastic approach to life and love of new experiences. This scent enhances your naturally uplifting presence.",
    "Revolt": "Revolt's energetic boldness perfectly matches your adventurous Sagittarius spirit. The spicy, invigorating profile supports your love of freedom and exploration, while the woody base grounds your philosophical nature. This scent enhances your enthusiasm and independent thinking.",
    "Utopia": "Utopia's expansive, dreamy character resonates with your philosophical Sagittarius mind. The soothing lavender and violet notes complement your optimistic outlook, while the comforting base supports your quest for meaning. This scent enhances your inspirational energy and love of freedom."
  },
  "Capricorn": {
    "Atlantis": "For the disciplined Capricorn, Atlantis offers refreshing support for your ambitious nature. Its precisely structured composition satisfies your appreciation for quality and refinement. This sophisticated yet energizing scent complements your determined approach to both work and play.",
    "1970": "The timeless elegance of 1970 perfectly complements your traditional Capricorn values. Its sophisticated blend of warm spices, leather, and woods reflects your mature outlook and appreciation for enduring quality. This scent enhances your accomplished presence and disciplined character.",
    "Royal": "Royal's distinguished character matches your ambitious Capricorn nature. The powerful yet refined blend of bergamot, rose, and precious woods reflects your strategic approach to life and appreciation for status. This scent enhances your natural authority and dignified presence.",
    "Revolt": "Revolt's bold character complements your determined Capricorn drive. The energetic spicy notes support your ambitious goals, while the grounding woods reflect your practical nature. This scent enhances your natural leadership and perseverance."
  },
  "Aquarius": {
    "Atlantis": "For the uniquely sporty Aquarius, Atlantis offers fresh energy with an innovative twist. Its unusual combination of citrus, aquatic, and amber notes satisfies your unconventional tastes. This forward-thinking scent supports your inventive approach to activity and life in general.",
    "Shelby": "Shelby's unique profile perfectly matches your innovative Aquarius thinking. Its unexpected combination of sage, fruits, and woods satisfies your desire for originality. This scent enhances your inventive mind and independent spirit.",
    "Revolt": "Revolt's boundary-breaking boldness is ideal for your revolutionary Aquarius spirit. The unexpected combination of spices, woods, and incense reflects your progressive thinking and humanitarian values. This scent enhances your originality and visionary perspective.",
    "Garden Breeze": "Garden Breeze's refreshing uniqueness resonates with your innovative Aquarius mind. The unexpected blend of mint, green notes, and florals reflects your original thinking, while the airy quality connects to your air sign nature. This scent enhances your humanitarian spirit and intellectual gifts."
  },
  "Pisces": {
    "Atlantis": "For the soft but agile Pisces, Atlantis offers refreshing energy with dreamy undertones. Its aquatic notes connect deeply to your water sign nature, creating a sense of being in your element. This flowing, adaptable scent supports your intuitive movement through life and natural grace.",
    "Feeling Good": "Sweet & dreamy, Feeling Good perfectly captures your sensitive Pisces soul. Its soft, romantic blend of raspberry, florals, and warm amber reflects your compassionate nature and artistic spirit. This scent enhances your natural empathy and imagination.",
    "Utopia": "Utopia's dreamy, ethereal character is created for your imaginative Pisces nature. The gentle lavender and violet notes float like your water sign essence, while the comforting base grounds your intuitive gifts. This scent enhances your artistic talents and compassionate heart.",
    "1970": "The gentle warmth of 1970 resonates with your compassionate Pisces soul. Its nostalgic character connects to your old-soul nature, while the honey and vanilla notes reflect your sweet disposition. This scent enhances your artistic sensitivity and emotional intelligence."
  }
}
